Repository: mathieui/pleaseshare
Catalog: pleaseshare/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: Upload not found
fr: Fichier non trouvé

source: Missing field in deletion form.
fr: Champ non rempli dans le formulaire de suppression.

source: Uploaded file {} not found.
fr: Fichier {} non trouvé.

source: Uploaded file {} cannot be deleted (no deletion password exists).
fr: Le fichier {} ne peut pas être supprimé (pas de mot de passe de suppression).

source: Upload {} deleted successfully.
fr: Fichier {} supprimé.

source: Wrong password
fr: Mauvais mot de passe

source: File required.
fr: Fichier requis.

source: Server error
fr: Erreur interne

source: Extracted archive too big, fallback to single-file upload.
fr: Archive trop volumineuse pour être extraite, retour au mode fichier unique.

source: Invalid archive, fallback to single-file upload.
fr: Archive invalide, retour au mode fichier unique.

source: Uploader name
fr: Créateur

source: Anonymous
fr: Anonyme

source: Password (used for deletion)
fr: Mot de passe

source: File to upload
fr: Choisissez un fichier à envoyer

source: Private torrent?
fr: Torrent privé ?

source: Extract file
fr: Extraire

source: Webseeds
fr: Sources web

source: Short description
fr: Description

source: Password for deletion:
fr: Mot de passe de suppression :

source: About
fr: À propos

source: What is pleaseshare?
fr: Qu’est-ce que pleaseshare ?

source: Pleaseshare is a file-sharing website, with "sharing" as its core value.
fr: PleaseShare est un site de partage de fichiers, qui dépend également du partage de fichiers entre ses utilisateurs.

source: It means that there won’t be a direct link on your file once you upload it, but pleaseshare will generate a torrent for you, with a webseed. Therefore, people who download the file will always get the best speed available (since there is a webseed, it will be at worst the same speed as if they downloaded it directly via http). It also means that the uploader can use this torrent to seed the file that is already on his computer, thus increasing the download speed for people on the other end.
fr: Cela veut dire que PleaseShare ne va pas fournir de lien direct vers votre fichier une fois que vous l’aurez envoyé. À la place, PleaseShare va générer un torrent, qui contient une source web. En utilisant ce torrent, les gens qui téléchargent le fichier auront une vitesse de téléchargement optimale (ce sera <strong>au pire</strong> la même vitesse qu’en téléchargement http direct). Cela veut dire également que la personne qui envoie le fichier peut directement partager le fichier qui est présent sur son ordinateur, augmentant d’emblée la vitesse pour les autres téléchargeurs.

source: Things to know
fr: À savoir

source: Please note that pleaseshare relies on the Bittorent DHT, which means that no trackers are needed to get peers.
fr: PleaseShare s’appuie sur la DHT Bittorent, ce qui veut dire que des trackers ne sont pas obligatoires pour trouver des pairs.

source: You can provide trackers if you want, but you don’t have to.
fr: Vous pouvez fournir des trackers si vous voulez, mais ce n’est pas nécéssaire

source: Trackers will be added by the server even if you don’t add them.
fr: Des trackers seront ajoutés par ce serveur automatiquement.

source: You must also understand that, even if pleaseshare allows you to delete the files that you upload on this server, the torrent can still stay active without a webseed.
fr: Il faut également comprendre que, même si pleaseshare vous permet de supprimer les fichiers que vous envoyez sur ce serveur, le torent peut rester actif même sans la source web.

source: Pleaseshare is licenced under the AGPL v3, with some GPL bits coming from the deluge client. And the source is <a href="https://gitorious.org/pleaseshare" title="pleaseshare source">on gitorious</a>.
fr: PleaseShare est sous licence AGPLv3, avec des bouts sous GPL venant du client deluge. Les sources sont disponibles <a href="https://gitorious.org/pleaseshare" title="pleaseshare source">sur gitorious</a>.

source: Your uploads
fr: Vos fichiers

source: Need help?
fr: Aide

source: Terms of Service
fr: Conditions d’utilisation

source: ToS
fr: Conditions

source: Help
fr: Aide

source: I can only upload one file?
fr: Je dois envoyer un seul fichier ?

source: Yes, at the moment, due to the limitations of html, it is impossible to upload folders directly.
fr: Oui, actuellement les limitations de HTML ne permettent pas de sélectionner des dossiers directement.

source: However, if you upload an archive
fr: Cependant, si vous envoyez une archive

source: (.zip/.tar, possibly compressed)
fr: (.zip/.tar, avec ou sans compression)

source: (.tar, uncompressed)
fr: (.tar, sans compression)

source: and toggle the option "Extract archive" the torrent will contain the files of this archive, under a subdirectory named after the archive (minus the .extension part).
fr: et activez l’option "Extraire", le torrent contiendra les fichiers de cette archive, dans un sous-dossier nommé comme l’archive (sans le .extension).

source: I uploaded a file, what now?
fr: Qu’est-ce que je fais ensuite ?

source: , or the magnet link
fr: , ou le lien magnet

source: You should also start the torrent into your favorite torrent client, this way, you will be able to share it. If you don’t do that, the download speed for the people who want download the file will be smaller.
fr: Vous devriez également lancer le torrent dans votre client bittorent favori, cela vous permettra de le partager, et donc d’améliorer la vitesse de téléchargement du fichier pour les gens à qui vous fournirer le lien.

source: How do I delete a file if I don’t want to keep sharing it?
fr: Comment supprimer un fichier ?

source: You have to go to the page for the file and enter the deletion password into the box at the bottom of the page. If you don’t have the password, we have no way of knowing if you are the initial uploader (because this service is entirely anonymous) and therefore we will not be able to comply with your request. <br/> You should also understand that because of the way the torrent network was built, the file cannot be remotely deleted on the computers of the file-sharers. So while the file is gone from the website, it might still be shared and accessible via a saved torrent file or magnet link.
fr: Vous devez aller sur la page correspondant à votre fichier et entrer le mot de passe de suppression. Si vous n’avez pas entré de mot de passe au moment de l’envoi, nous n’avons aucun moyen de savoir que c’est vous qui avez envoyé le fichier (puisque ce service est anonyme). Il faut également prendre en compte qu’à cause de la façon de fonctionner de bittorent, supprimer le fichier sur le site ne permet pas d’empêcher les gens de partager les torrents/magnet déjà publics.

source: I see "magnet link", what’s this?
fr: Qu’est-ce qu’un « lien magnet » ?

source: Magnet links are created from the torrent file, in order to have something easy to share between people, via text messaging or whatever. Technically, your torrent client will search people who have the torrent file, and download it from them, then download the files in the torrent, so it always need at least one client which has the torrent. Note that using magnet links does not give you the webseeds, so you are missing one of the advantages of this website (a minimal guaranteed bandwith).
fr: Les liens magnets sont créés à partir du fichier torrent, afin d’avoir quelque chose de facile à partager avec d’autres gens (via SMS ou autre). En pratique, votre client torrent va recherche les gens qui ont le même torrent, et télécharger les fichiers depuis eux. C’est pourquoi utiliser les liens magnet nécessite au moins un utilisateur qui a les fichiers. Utiliser les liens magnet ne permet pas de profiter des avantages offerts par pleaseshare (vitesse minimale garantie).

source: What can I do here?
fr: Options disponibles

source: Multifile torrents are enabled
fr: Les torrents à fichiers multiples sont activés

source: Multifile torrents are disabled
fr: Les torrents à fichiers multiples sont désactivés

source: Adding webseeds to the torrent is enabled
fr: Ajouter des sources web dans le torrent est possible

source: Adding webseeds to the torrent is forbidden
fr: Ajouter des sources web dans le torrent est interdit

source: Adding trackers to the torrent is enabled
fr: Ajouter des trackers dans le torrent est possible

source: Adding trackers to the torrent is disabled
fr: Ajouter des trackers dans le torrent est interdit

source: Creation of private torrents is allowed
fr: Il est possible de créer des torrents privés

source: Creation of private torrents is forbidden
fr: Il est impossible de créer des torrents privés

source: The max file size is %(maxsize)s MiB
fr: La taille maximum des fichiers est de %(maxsize)s Mio

source: The default trackers are:
fr: Les trackers par défaut sont :

source: The forced trackers are:
fr: Les trackers ajoutés automatiquement sont :

source: Send file
fr: Envoyer

source: Note: the filesize limit is currently set at %(maxsize)s MiB.
fr: Note: Taille max: %(maxsize)s Mio.

source: About PleaseShare
fr: Qu’est-ce que pleaseshare ?

source: Using PleaseShare is easy:
fr: Utiliser PleaseShare est facile :

source: You upload a file (or an archive, see the options below);
fr: Vous envoyez un fichier (ou une archive, selon les options activées) ;

source: You get a <strong>.torrent</strong> file
fr: Vous obtenez un fichier <strong>.torrent</strong>

source: and a <strong>magnet link</strong>
fr: et un <strong>lien magnet</strong>

source: to share with your friends;
fr: à partager avec vos amis;

source: Subsequent downloads are at least <strong>as fast as</strong> a direct HTTP download: this server acts as a <strong>webseed</strong> for the created torrent.
fr: Les téléchargements sont ensuite <strong>au moins aussi rapides</strong> qu’un téléchargement HTTP direct, puisque ce serveur sert de <strong>source web</strong> pour le torrent.

source: PleaseShare is <a href="http://www.gnu.org/philosophy/free-sw.en.html">free software</a>, <a href="https://gitorious.org/pleaseshare">get the code</a>. More about PleaseShare <a href="%(url_about)s">here</a>. Need <a href="%(url_help)s">help</a>?
fr: PleaseShare est un <a href="http://www.gnu.org/philosophy/free-sw.en.html">logiciel libre</a>, <a href="https://gitorious.org/pleaseshare">obtenir le code</a>. Plus d’informations sur PleaseShare <a href="%(url_about)s">ici</a>. Besoin d’<a href="%(url_help)s">aide</a> ?

source: You must specify trackers if you wand to create a private torrent!
fr: Vous devez fournir des trackers si vous voulez un torrent privé !

source: Uploads
fr: Fichiers

source: No uploads.
fr: Pas de fichiers.

source: Your torrent
fr: Votre torrent

source: Name
fr: Nom

source: Size
fr: Taille

source: Uploader
fr: Créateur

source: Download .torrent
fr: Télécharger le .torrent

source: Download file
fr: Télécharger le fichier

source: Magnet link
fr: Lien magnet

source: Delete
fr: Supprimer

source: Files…
fr: Fichiers…
